import java.util.Scanner;

public class Signs {
    //хвост, плавники, крылья, перья, чешуя, хитин, шерсть, клюв, зубы, жабры
    private static final int[][] examples = new int[][]{
            /* 0 акула*/       {1, 1, 0, 0, 0, 0, 0, 0, 1, 1},
            /* 1 бабочка*/     {0, 0, 1, 0, 0, 1, 0, 0, 0, 0},
            /* 2 змея*/        {1, 0, 0, 0, 1, 0, 0, 0, 1, 0},
            /* 3 гусеица*/     {1, 0, 0, 0, 0, 1, 0, 0, 0, 0},
            /* 4 крокодил*/    {1, 0, 0, 0, 0, 0, 0, 0, 1, 0},
            /* 5 паук*/        {0, 0, 0, 0, 0, 1, 0, 0, 0, 0},
            /* 6 жук*/         {0, 0, 1, 0, 0, 1, 0, 0, 0, 0},
            /* 7 таракан*/     {0, 0, 0, 0, 0, 1, 0, 0, 0, 0},
            /* 8 клоп*/        {0, 0, 0, 0, 0, 1, 0, 0, 0, 0},
            /* 9 ехидна*/      {0, 0, 0, 0, 0, 0, 1, 1, 0, 0},
            /*10 пиранья*/     {1, 1, 0, 0, 1, 0, 0, 0, 1, 1},
            /*11 медведь*/     {0, 0, 0, 0, 0, 0, 1, 0, 1, 0},
            /*12 бобер*/       {1, 0, 0, 0, 0, 0, 1, 0, 1, 0},
            /*13 попугай*/     {1, 0, 1, 1, 0, 0, 0, 1, 0, 0},
            /*14 чайка*/       {1, 0, 1, 1, 0, 0, 0, 1, 0, 0},
            /*15 гусь*/        {1, 0, 1, 1, 0, 0, 0, 1, 1, 0},
            /*16 лещ*/         {1, 1, 0, 0, 1, 0, 0, 0, 1, 1},
            /*17 карп*/        {1, 1, 0, 0, 1, 0, 0, 0, 1, 1},
            /*18 лев*/         {1, 0, 0, 0, 0, 0, 1, 0, 1, 0},
            /*19 обезьяна*/    {1, 0, 0, 0, 0, 0, 1, 0, 1, 0},
            /*20 тунец*/       {1, 1, 0, 0, 1, 0, 0, 0, 1, 1},
            /*21 кенгуру*/     {1, 0, 0, 0, 0, 0, 1, 0, 1, 0},
            /*22 воробей*/     {1, 0, 1, 1, 0, 0, 0, 1, 0, 0},
            /*23 голубь*/      {1, 0, 1, 1, 0, 0, 0, 1, 0, 0},
            /*24 аист*/        {1, 0, 1, 1, 0, 0, 0, 1, 0, 0},
    };
    //птица, рыба, зверь, насекомое
    private static final int[][] results = new int[][]{
            /*акула*/       {0, 1, 0, 0},
            /*бабочка*/     {0, 0, 0, 1},
            /*змея*/        {0, 0, 1, 0},
            /*гусеица*/     {0, 0, 0, 1},
            /*крокодил*/    {0, 0, 1, 0},
            /*паук*/        {0, 0, 0, 1},
            /*жук*/         {0, 0, 0, 1},
            /*таракан*/     {0, 0, 0, 1},
            /*клоп*/        {0, 0, 0, 1},
            /*ехидна*/      {0, 0, 1, 0},
            /*пиранья*/     {0, 1, 0, 0},
            /*медведь*/     {0, 0, 1, 0},
            /*бобер*/       {0, 0, 1, 0},
            /*попугай*/     {1, 0, 0, 0},
            /*чайка*/       {1, 0, 0, 0},
            /*гусь*/        {1, 0, 0, 0},
            /*лещ*/         {0, 1, 0, 0},
            /*карп*/        {0, 1, 0, 0},
            /*лев*/         {0, 0, 1, 0},
            /*обезьяна*/    {0, 0, 1, 0},
            /*тунец*/       {0, 1, 0, 0},
            /*кенгуру*/     {0, 0, 1, 0},
            /*воробей*/     {1, 0, 0, 0},
            /*голубь*/      {1, 0, 0, 0},
            /*аист*/        {1, 0, 0, 0}
    };

    public int[][] getExamples(){
        return examples;
    }

    public int[][] getResults(){
        return results;
    }

    public int[] setExample(){
        int[] ex = new int[10];
        Scanner sc = new Scanner(System.in);
        System.out.println("Хвост:");
        ex[0] = sc.nextInt();
        System.out.println("Плавники:");
        ex[1] = sc.nextInt();
        System.out.println("Крылья:");
        ex[2] = sc.nextInt();
        System.out.println("Перья:");
        ex[3] = sc.nextInt();
        System.out.println("Чешуя:");
        ex[4] = sc.nextInt();
        System.out.println("Хитин:");
        ex[5] = sc.nextInt();
        System.out.println("Шерсть:");
        ex[6] = sc.nextInt();
        System.out.println("Клюв:");
        ex[7] = sc.nextInt();
        System.out.println("Зубы:");
        ex[8] = sc.nextInt();
        System.out.println("Жабры:");
        ex[9] = sc.nextInt();
        return ex;
    }
}
